[
    {
        "char": "Ace",
        "desc": [
            "Created from a rare phenomenon within a sealed-off forest, Ace was born knowing his duty: to protect his dimension. He has looked the same since he was created, with the only features different about him are his clothes, hardly seeable scars from being fed on by his vampire best friend, Luna, and his more muscular body. Ace is commonly called by his nickname, 'Daring Ace', because when engaged in battles that are not as dangerous to civilians and the area around him, Ace would often let a battle drag on to learn instead of obliterating his opponent with a quick swipe of his scythe.",
	        "When not occupied in protecting his dimension, Ace can often be spotted blacksmithing weapons, hanging out with friends, enjoying off-time in his house made from specialized emeralds, and training his students. The crown floating around his hair is bestowed upon him from his dimension, Xonri, granting him special powers to travel over five times the speed of light, with misty-white afterimages being the only thing to see of him.",
	        "The scythe he wields, Evött, was forged using rare materials from Xonri. His scythe cuts through any material like butter, no matter how durable the object, weapon or person may be. Ace is the most hellacious person to inflict any damage upon in his dimension, as it is almost impossible for any weapon or magic to harm him, plus his regeneration."
        ]
    },
    {
        "char": "Luna Veil Osmont",

        "desc": [
            "Inheriting the bunny ears from her mother and the vampiric traits of her father, Luna is nimble and powerful, able to finish fights relatively quickly. Although she cannot take many hits, she can deal with effective attacks to finish a fight before any harm is inflicted on her in battle. ",
            "When Luna was 15, her father and mother were killed in front of her eyes by a psychopath who infiltrated Luna’s residence. She had met Ace as her savior, taking out the evil fiend that shamelessly killed Luna’s parents. Ever since that day then, Luna has been traveling along with Ace, keeping their relationship strong and close. Luna is with Ace almost every day, only apart when she goes to her new home or when Ace takes a vacation in another Dimension.", "Luna does not know how to handle her hunger as well as the other Nightfang Vampires, creating troublesome situations where Ace has to prevent her from going bloodthirsty on the innocent. When this occurs, Ace often allows Luna to feed on him, which stops the hunger problem. Luna changes her personality entirely when hungry, with her eyes bursting into black flames. She is slower yet more powerful when she has her transformation due to hunger, which is a difference from her normal fast yet not-as-powerful-as-when-hungry state."
        ]
    }
]